{
  "add_bos_token": true,
  "add_eos_token": true,
  "bos_token": "<|begin_of_text|>",
  "chat_template": "{% for message in messages %}{% if message['role'] == 'user' %}<|user|>\n{{ message['content'] }}\n<|assistant|>\n{% elif message['role'] == 'assistant' %}{{ message['content'] }}\n{% endif %}{% endfor %}",
  "clean_up_tokenization_spaces": false,
  "eos_token": "<|end_of_text|>",
  "legacy": false,
  "model_max_length": 2048,
  "pad_token": "<|pad|>",
  "sp_model_kwargs": {},
  "tokenizer_class": "LlamaTokenizer",
  "unk_token": "<|unk|>",
  "use_default_system_prompt": false
}